LuckiBit/stm32-template/stm32f103rc/application/hardware/bsp/gpio/bsp_gpio.c
/* GPIOB pin 2 configuration. */
#define BSP_GPIOB_2_PORT          GPIOB
#define BSP_GPIOB_2_PIN           GPIO_PIN_2
#define BSP_GPIOB_2_INITIALIZE    true
#define BSP_GPIOB_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_2_PULL          GPIO_NOPULL
#define BSP_GPIOB_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_2_IS_OUTPUT     false

/* GPIOB pin 3 configuration. */
#define BSP_GPIOB_3_PORT          GPIOB
#define BSP_GPIOB_3_PIN           GPIO_PIN_3
#define BSP_GPIOB_3_INITIALIZE    true
#define BSP_GPIOB_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_3_PULL          GPIO_NOPULL
#define BSP_GPIOB_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_3_IS_OUTPUT     false

/* GPIOB pin 4 configuration. */
#define BSP_GPIOB_4_PORT          GPIOB
#define BSP_GPIOB_4_PIN           GPIO_PIN_4
#define BSP_GPIOB_4_INITIALIZE    true
#define BSP_GPIOB_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_4_PULL          GPIO_NOPULL
#define BSP_GPIOB_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_4_IS_OUTPUT     false

/* GPIOB pin 5 configuration. */
#define BSP_GPIOB_5_PORT          GPIOB
#define BSP_GPIOB_5_PIN           GPIO_PIN_5
#define BSP_GPIOB_5_INITIALIZE    true
#define BSP_GPIOB_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_5_PULL          GPIO_NOPULL
#define BSP_GPIOB_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_5_IS_OUTPUT     false

/* GPIOB pin 6 configuration. */
#define BSP_GPIOB_6_PORT          GPIOB
#define BSP_GPIOB_6_PIN           GPIO_PIN_6
#define BSP_GPIOB_6_INITIALIZE    true
#define BSP_GPIOB_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_6_PULL          GPIO_NOPULL
#define BSP_GPIOB_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_6_IS_OUTPUT     false

/* GPIOB pin 7 configuration. */
#define BSP_GPIOB_7_PORT          GPIOB
#define BSP_GPIOB_7_PIN           GPIO_PIN_7
#define BSP_GPIOB_7_INITIALIZE    true
#define BSP_GPIOB_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_7_PULL          GPIO_NOPULL
#define BSP_GPIOB_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_7_IS_OUTPUT     false

/* GPIOB pin 8 configuration. */
#define BSP_GPIOB_8_PORT          GPIOB
#define BSP_GPIOB_8_PIN           GPIO_PIN_8
#define BSP_GPIOB_8_INITIALIZE    true
#define BSP_GPIOB_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_8_PULL          GPIO_NOPULL
#define BSP_GPIOB_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_8_IS_OUTPUT     false

/* GPIOB pin 9 configuration. */
#define BSP_GPIOB_9_PORT          GPIOB
#define BSP_GPIOB_9_PIN           GPIO_PIN_9
#define BSP_GPIOB_9_INITIALIZE    true
#define BSP_GPIOB_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_9_PULL          GPIO_NOPULL
#define BSP_GPIOB_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_9_IS_OUTPUT     false

/* GPIOB pin 10 configuration. */
#define BSP_GPIOB_10_PORT          GPIOB
#define BSP_GPIOB_10_PIN           GPIO_PIN_10
#define BSP_GPIOB_10_INITIALIZE    true
#define BSP_GPIOB_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_10_PULL          GPIO_NOPULL
#define BSP_GPIOB_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_10_IS_OUTPUT     false

/* GPIOB pin 11 configuration. */
#define BSP_GPIOB_11_PORT          GPIOB
#define BSP_GPIOB_11_PIN           GPIO_PIN_11
#define BSP_GPIOB_11_INITIALIZE    true
#define BSP_GPIOB_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_11_PULL          GPIO_NOPULL
#define BSP_GPIOB_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_11_IS_OUTPUT     false

/* GPIOB pin 12 configuration. */
#define BSP_GPIOB_12_PORT          GPIOB
#define BSP_GPIOB_12_PIN           GPIO_PIN_12
#define BSP_GPIOB_12_INITIALIZE    true
#define BSP_GPIOB_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_12_PULL          GPIO_NOPULL
#define BSP_GPIOB_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_12_IS_OUTPUT     false

/* GPIOB pin 13 configuration. */
#define BSP_GPIOB_13_PORT          GPIOB
#define BSP_GPIOB_13_PIN           GPIO_PIN_13
#define BSP_GPIOB_13_INITIALIZE    true
#define BSP_GPIOB_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_13_PULL          GPIO_NOPULL
#define BSP_GPIOB_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_13_IS_OUTPUT     false

/* GPIOB pin 14 configuration. */
#define BSP_GPIOB_14_PORT          GPIOB
#define BSP_GPIOB_14_PIN           GPIO_PIN_14
#define BSP_GPIOB_14_INITIALIZE    true
#define BSP_GPIOB_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_14_PULL          GPIO_NOPULL
#define BSP_GPIOB_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_14_IS_OUTPUT     false

/* GPIOB pin 15 configuration. */
#define BSP_GPIOB_15_PORT          GPIOB
#define BSP_GPIOB_15_PIN           GPIO_PIN_15
#define BSP_GPIOB_15_INITIALIZE    true
#define BSP_GPIOB_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOB_15_PULL          GPIO_NOPULL
#define BSP_GPIOB_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOB_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOB_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOB_15_IS_OUTPUT     false

/* GPIOC pin 0 configuration. */
#define BSP_GPIOC_0_PORT          GPIOC
#define BSP_GPIOC_0_PIN           GPIO_PIN_0
#define BSP_GPIOC_0_INITIALIZE    true
#define BSP_GPIOC_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_0_PULL          GPIO_NOPULL
#define BSP_GPIOC_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_0_IS_OUTPUT     false

/* GPIOC pin 1 configuration. */
#define BSP_GPIOC_1_PORT          GPIOC
#define BSP_GPIOC_1_PIN           GPIO_PIN_1
#define BSP_GPIOC_1_INITIALIZE    true
#define BSP_GPIOC_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_1_PULL          GPIO_NOPULL
#define BSP_GPIOC_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_1_IS_OUTPUT     false

/* GPIOC pin 2 configuration. */
#define BSP_GPIOC_2_PORT          GPIOC
#define BSP_GPIOC_2_PIN           GPIO_PIN_2
#define BSP_GPIOC_2_INITIALIZE    true
#define BSP_GPIOC_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_2_PULL          GPIO_NOPULL
#define BSP_GPIOC_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_2_IS_OUTPUT     false

/* GPIOC pin 3 configuration. */
#define BSP_GPIOC_3_PORT          GPIOC
#define BSP_GPIOC_3_PIN           GPIO_PIN_3
#define BSP_GPIOC_3_INITIALIZE    true
#define BSP_GPIOC_3_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_3_PULL          GPIO_NOPULL
#define BSP_GPIOC_3_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_3_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_3_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_3_IS_OUTPUT     false

/* GPIOC pin 4 configuration. */
#define BSP_GPIOC_4_PORT          GPIOC
#define BSP_GPIOC_4_PIN           GPIO_PIN_4
#define BSP_GPIOC_4_INITIALIZE    true
#define BSP_GPIOC_4_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_4_PULL          GPIO_NOPULL
#define BSP_GPIOC_4_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_4_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_4_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_4_IS_OUTPUT     false

/* GPIOC pin 5 configuration. */
#define BSP_GPIOC_5_PORT          GPIOC
#define BSP_GPIOC_5_PIN           GPIO_PIN_5
#define BSP_GPIOC_5_INITIALIZE    true
#define BSP_GPIOC_5_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_5_PULL          GPIO_NOPULL
#define BSP_GPIOC_5_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_5_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_5_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_5_IS_OUTPUT     false

