LuckiBit/stm32-template/stm32f103rc/application/hardware/bsp/gpio/bsp_gpio.c
/* GPIOC pin 6 configuration. */
#define BSP_GPIOC_6_PORT          GPIOC
#define BSP_GPIOC_6_PIN           GPIO_PIN_6
#define BSP_GPIOC_6_INITIALIZE    true
#define BSP_GPIOC_6_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_6_PULL          GPIO_NOPULL
#define BSP_GPIOC_6_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_6_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_6_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_6_IS_OUTPUT     false

/* GPIOC pin 7 configuration. */
#define BSP_GPIOC_7_PORT          GPIOC
#define BSP_GPIOC_7_PIN           GPIO_PIN_7
#define BSP_GPIOC_7_INITIALIZE    true
#define BSP_GPIOC_7_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_7_PULL          GPIO_NOPULL
#define BSP_GPIOC_7_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_7_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_7_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_7_IS_OUTPUT     false

/* GPIOC pin 8 configuration. */
#define BSP_GPIOC_8_PORT          GPIOC
#define BSP_GPIOC_8_PIN           GPIO_PIN_8
#define BSP_GPIOC_8_INITIALIZE    true
#define BSP_GPIOC_8_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_8_PULL          GPIO_NOPULL
#define BSP_GPIOC_8_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_8_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_8_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_8_IS_OUTPUT     false

/* GPIOC pin 9 configuration. */
#define BSP_GPIOC_9_PORT          GPIOC
#define BSP_GPIOC_9_PIN           GPIO_PIN_9
#define BSP_GPIOC_9_INITIALIZE    true
#define BSP_GPIOC_9_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_9_PULL          GPIO_NOPULL
#define BSP_GPIOC_9_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_9_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_9_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_9_IS_OUTPUT     false

/* GPIOC pin 10 configuration. */
#define BSP_GPIOC_10_PORT          GPIOC
#define BSP_GPIOC_10_PIN           GPIO_PIN_10
#define BSP_GPIOC_10_INITIALIZE    true
#define BSP_GPIOC_10_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_10_PULL          GPIO_NOPULL
#define BSP_GPIOC_10_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_10_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_10_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_10_IS_OUTPUT     false

/* GPIOC pin 11 configuration. */
#define BSP_GPIOC_11_PORT          GPIOC
#define BSP_GPIOC_11_PIN           GPIO_PIN_11
#define BSP_GPIOC_11_INITIALIZE    true
#define BSP_GPIOC_11_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_11_PULL          GPIO_NOPULL
#define BSP_GPIOC_11_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_11_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_11_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_11_IS_OUTPUT     false

/* GPIOC pin 12 configuration. */
#define BSP_GPIOC_12_PORT          GPIOC
#define BSP_GPIOC_12_PIN           GPIO_PIN_12
#define BSP_GPIOC_12_INITIALIZE    true
#define BSP_GPIOC_12_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_12_PULL          GPIO_NOPULL
#define BSP_GPIOC_12_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_12_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_12_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_12_IS_OUTPUT     false

/* GPIOC pin 13 configuration. */
#define BSP_GPIOC_13_PORT          GPIOC
#define BSP_GPIOC_13_PIN           GPIO_PIN_13
#define BSP_GPIOC_13_INITIALIZE    true
#define BSP_GPIOC_13_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_13_PULL          GPIO_NOPULL
#define BSP_GPIOC_13_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_13_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_13_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_13_IS_OUTPUT     false

/* GPIOC pin 14 configuration. */
#define BSP_GPIOC_14_PORT          GPIOC
#define BSP_GPIOC_14_PIN           GPIO_PIN_14
#define BSP_GPIOC_14_INITIALIZE    true
#define BSP_GPIOC_14_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_14_PULL          GPIO_NOPULL
#define BSP_GPIOC_14_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_14_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_14_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_14_IS_OUTPUT     false

/* GPIOC pin 15 configuration. */
#define BSP_GPIOC_15_PORT          GPIOC
#define BSP_GPIOC_15_PIN           GPIO_PIN_15
#define BSP_GPIOC_15_INITIALIZE    true
#define BSP_GPIOC_15_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOC_15_PULL          GPIO_NOPULL
#define BSP_GPIOC_15_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOC_15_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOC_15_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOC_15_IS_OUTPUT     false

/* GPIOD pin 0 configuration. */
#define BSP_GPIOD_0_PORT          GPIOD
#define BSP_GPIOD_0_PIN           GPIO_PIN_0
#define BSP_GPIOD_0_INITIALIZE    false
#define BSP_GPIOD_0_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_0_PULL          GPIO_NOPULL
#define BSP_GPIOD_0_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_0_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_0_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_0_IS_OUTPUT     false

/* GPIOD pin 1 configuration. */
#define BSP_GPIOD_1_PORT          GPIOD
#define BSP_GPIOD_1_PIN           GPIO_PIN_1
#define BSP_GPIOD_1_INITIALIZE    false
#define BSP_GPIOD_1_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_1_PULL          GPIO_NOPULL
#define BSP_GPIOD_1_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_1_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_1_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_1_IS_OUTPUT     false

/* GPIOD pin 2 configuration. */
#define BSP_GPIOD_2_PORT          GPIOD
#define BSP_GPIOD_2_PIN           GPIO_PIN_2
#define BSP_GPIOD_2_INITIALIZE    true
#define BSP_GPIOD_2_MODE          GPIO_MODE_ANALOG
#define BSP_GPIOD_2_PULL          GPIO_NOPULL
#define BSP_GPIOD_2_SPEED         GPIO_SPEED_FREQ_LOW
#define BSP_GPIOD_2_INITIAL_STATE GPIO_PIN_RESET
#define BSP_GPIOD_2_SAFE_STATE    GPIO_PIN_RESET
#define BSP_GPIOD_2_IS_OUTPUT     false

#define BSP_GPIO_PIN_CONFIG_LIST(APPLY) \
    APPLY(BSP_GPIOA_0) \
    APPLY(BSP_GPIOA_1) \
    APPLY(BSP_GPIOA_2) \
    APPLY(BSP_GPIOA_3) \
    APPLY(BSP_GPIOA_4) \
    APPLY(BSP_GPIOA_5) \
    APPLY(BSP_GPIOA_6) \
    APPLY(BSP_GPIOA_7) \
    APPLY(BSP_GPIOA_8) \
    APPLY(BSP_GPIOA_9) \
    APPLY(BSP_GPIOA_10) \
    APPLY(BSP_GPIOA_11) \
    APPLY(BSP_GPIOA_12) \
    APPLY(BSP_GPIOA_13) \
    APPLY(BSP_GPIOA_14) \
    APPLY(BSP_GPIOA_15) \
    APPLY(BSP_GPIOB_0) \
    APPLY(BSP_GPIOB_1) \
    APPLY(BSP_GPIOB_2) \
    APPLY(BSP_GPIOB_3) \
    APPLY(BSP_GPIOB_4) \
    APPLY(BSP_GPIOB_5) \
    APPLY(BSP_GPIOB_6) \
    APPLY(BSP_GPIOB_7) \
    APPLY(BSP_GPIOB_8) \
    APPLY(BSP_GPIOB_9) \
    APPLY(BSP_GPIOB_10) \
    APPLY(BSP_GPIOB_11) \
    APPLY(BSP_GPIOB_12) \
    APPLY(BSP_GPIOB_13) \
    APPLY(BSP_GPIOB_14) \
    APPLY(BSP_GPIOB_15) \
    APPLY(BSP_GPIOC_0) \
    APPLY(BSP_GPIOC_1) \
    APPLY(BSP_GPIOC_2) \
    APPLY(BSP_GPIOC_3) \
    APPLY(BSP_GPIOC_4) \
    APPLY(BSP_GPIOC_5) \
    APPLY(BSP_GPIOC_6) \
    APPLY(BSP_GPIOC_7) \
    APPLY(BSP_GPIOC_8) \
    APPLY(BSP_GPIOC_9) \
    APPLY(BSP_GPIOC_10) \
    APPLY(BSP_GPIOC_11) \
    APPLY(BSP_GPIOC_12) \
    APPLY(BSP_GPIOC_13) \
    APPLY(BSP_GPIOC_14) \
    APPLY(BSP_GPIOC_15) \
    APPLY(BSP_GPIOD_0) \
    APPLY(BSP_GPIOD_1) \
    APPLY(BSP_GPIOD_2)

#define BSP_GPIO_LOAD_CASE(pin_name)                 \
    case pin_name:                                   \
        config.port          = pin_name##_PORT;      \
        config.pin           = pin_name##_PIN;       \
        config.initialize    = pin_name##_INITIALIZE;\
        config.mode          = pin_name##_MODE;      \
        config.pull          = pin_name##_PULL;      \
        config.speed         = pin_name##_SPEED;     \
        config.initial_state = pin_name##_INITIAL_STATE; \
        config.safe_state    = pin_name##_SAFE_STATE;    \
        config.is_output     = pin_name##_IS_OUTPUT; \
        break;

typedef struct
{
    GPIO_TypeDef  *port;
    uint16_t       pin;
    uint32_t       mode;
    uint32_t       pull;
    uint32_t       speed;
    GPIO_PinState  initial_state;
    GPIO_PinState  safe_state;
    bool           initialize;
    bool           is_output;
} bsp_gpio_pin_config_t;

static bool bsp_gpio_pin_is_valid(bsp_gpio_pin_t pin_id)
{
    return (uint32_t)pin_id < (uint32_t)BSP_GPIO_PIN_COUNT;
}

static bool bsp_gpio_level_is_valid(bsp_gpio_level_t level)
{
    return (level == BSP_GPIO_LEVEL_LOW) || (level == BSP_GPIO_LEVEL_HIGH);
}

static bsp_gpio_pin_config_t bsp_gpio_get_config(bsp_gpio_pin_t pin_id)
{
    bsp_gpio_pin_config_t config = {0};

